// © Copyright 2010, 2015-2016 HP Development Company, L.P.

TaskName = "掃描至電腦";

// Restore alert message
"RESTORE_TITLE" = "是否確定要還原設定?";
"RESTORE_MSG" = "如果繼續，則所有「掃描捷徑」皆將還原到其原始狀態。按「取消」，不變更捷徑，或者按「還原」，將捷徑還原到其原廠預設設定。";
"RESTORE_BUTTON_TITLE" = "還原";

"DEFAULT_TASK_CAPTION" = "工作名稱:";
"DONE" = "完成";

// Task not found alert message
"TASK_NOT_FOUND_TITLE" = "無法執行工作";
"TASK_NOT_FOUND_DESC" = "無法在系統中執行在裝置上找到的「%@」工作。請選擇其他工作。";

// Copy workflows fail alert message
"COPY_WORKFLOWS_TITLE" = "工作流複製失敗";
"COPY_WORKFLOWS_DESC" = "無法將工作流複製到使用者裝置網域資料夾";

"DEVICE_NOT_FOUND_TITLE" = "找不到裝置";
"DEVICE_NOT_FOUND_DESC" = "與裝置通訊時發生了問題。請確保裝置電源已開啟並且連線正常，然後再試一次。";

"COMPUTER_NAME_INFO_TITLE" = "「電腦名稱」欄位用於輸入要在 HP 裝置上顯示的電腦名稱。"; //title for the Computer name info sheet
"COMPUTER_NAME_INFO_DESC" = "可以輸入的字元數取決於裝置。";

"UNKNOWN_ERROR_TITLE" = "不明錯誤";
"UNKNOWN_ERROR_DESC" = "更新裝置時，發生了不明錯誤。請確保裝置電源已開啟並且連線正常。";

"OK" = "確定";
"CANCEL" = "取消";

"MOREINFO_TITLE" = "更多資訊";

// The following strings are displayed in SSMTaskController nib file

"SSM_TITLE" = "掃描捷徑管理員"; // Title
"SSM_SHORT_DESC" = "使用「掃描捷徑」可以執行使用 HP 裝置前板上之控制項的常見掃描工作。"; // short description
"YOUR_COMPUTER_NAME" = "電腦名稱:"; // displayed if device is connected through n/w
"CHANGE_BTN_TITLE" = "變更...";
"MORE_INFO_BTN_TITLE" = "更多資訊...";
"RESTORE_BTN_TITLE" = "還原預設值";
"TEST_BTN_TITLE" = "測試...";
"EDIT_BTN_TITLE" = "編輯...";

// Error Messages.
"ERROR_PERMISSION_DENIED" = "您對資料夾「%@」沒有適當的存取權限。若要檢視或變更存取權限，請在「尋找工具」中選擇項目，並選擇「檔案」>「獲得資訊」。"; // used from HPWFM, no need to get the localized string from customer.

// generic error
"ERROR" = "錯誤";
"ERROR_UNKNOWN_DESC" = "發生了不明錯誤。";

// Error when workflow not found when user clicks on front panel scan
"ERROR_SHORTCUT_NOT_FOUND_TITLE" = "找不到捷徑";
"ERROR_SHORTCUT_NOT_FOUND_DESC" = "找不到裝置 %2$@ 的捷徑 %1$@。請嘗試重新安裝軟體。";

// Error displayed when HPScanWorkflow object creation fails for execution of workflow in SEH interface execute method
"ERROR_WORKFLOW_CREATE_FAIL_TITLE" = "工作流建立失敗";
"ERROR_WORKFLOW_CREATE_FAIL_DESC" = "在建立工作流時，發生了不明錯誤。請再試一次。";

// Error displayed when copyworkflows fails as due to non availability of permission at user device domain folder
"ERROR_CREATING_DIR_TITLE" = "建立目錄時出錯";
"ERROR_CREATING_DIR_DESC" = "建立目錄 %@ 時發生了錯誤。請檢查父資料夾的存取權限，然後再試一次";

// Error displayed when workflow does not exists when user tries to open the same in Automator
"ERROR_OPENING_WORKFLOW_IN_AUTOMATOR_DESC" = "在 Automator 中開啟工作流「%@」時發生了錯誤。在工作流的原始位置找不到該工作流";

// New additions: 3/1/2010

// Error displayed when scan link ID received from the device is invalid
"ERROR_INVALID_SCAN_LINK_ID_TITLE" = "不支援掃描捷徑";
"ERROR_INVALID_SCAN_LINK_ID_DESC" = "由於軟體無法識別選定的掃描捷徑，所以無法執行該捷徑。請選擇其他掃描捷徑，然後再試一次。";

// Tool tips for change, edit and test button
"TIP_FOR_CHANGE_BTN" = "按一下即可變更電腦名稱";
"TIP_FOR_EDIT_BTN" = "編輯選定的工作";
"TIP_FOR_TEST_BTN" = "執行選定的工作";

// New additions: 3/1/2010

// Opt-in/Opt-out strings
"COMPUTER_NAME_TITLE" = "電腦名稱為";
"COMPUTER_NAME_DESCRIPTION" = "從 HP 裝置啟動掃描時，系統可能會提示您從啟用了「掃描至電腦」的主機電腦的清單中選取電腦。";
"COMPUTER" = "電腦";
"COMPUTERS" = "電腦";

"COMMUNICATION_ERROR" = "掃描器通訊無法建立。 請確認您的裝置電源已開啟、檢查連線，並確認網路是否正常運作。 請注意，裝置上必須啟用 Bonjour。";
"INSTALLATION_ERROR" = "此電腦上找不到「掃描至電腦」所需之 HP 軟體。 請從 http://www.hp.com/support 下載並安裝您裝置的最新 HP 建議軟體，然後再試一次。";

"SCAN_TO_COMPUTER_CANNOT_BE_ENABLED" = "無法啟用「掃描至電腦」";
"SCAN_TO_COMPUTER_DESCRIPTION" = "透過「掃描至電腦」，您可以從 HP 裝置的前板啟動掃描，並自動將輸出傳送至您的電腦。";

HSDScanActionNotFoundTitle = "找不到掃描動作";
HSDScanActionNotFoundDescription = "掃描動作未註冊。請啟動位於「%@」的 HP Scan 應用程式，以自動註冊掃描動作。";
